In [1]:
import requests
import pandas as pd
import hashlib
import time
from pprint import pprint

In [2]:
m = hashlib.md5()

In [3]:
t = time.strftime("%Y%d%m%H%M%S")

In [4]:
private_key = '69b650321683071b76e2efd65d5c6f91ebf26200'
public_key = '2fa0da01bf13cd7322443828e55ba972'

In [5]:
m.update("{}{}{}".format(t, private_key, public_key).encode('utf-8'))

In [6]:
hash = m.hexdigest()

In [9]:
def get_response(start_char):
    response = requests.get('https://gateway.marvel.com:443/v1/public/characters?apikey=2fa0da01bf13cd7322443828e55ba972&ts={}&hash={}&nameStartsWith={}&limit={}'.format(t, hash, start_char, 20))
    return response.json()

In [10]:
raw_data = []

In [11]:
for i in range(65, 91):
    raw_data.append(get_response(chr(i)))

In [12]:
len(raw_data)

26

In [13]:
character_info = []

for i in range(0, 26):
    for character in raw_data[i]['data']['results']:
        character_info.append([character['name'], character['comics']['available'], character['events']['available'], 
                               character['series']['available'], character['stories']['available'], character['id']])

In [16]:
marvels_database = pd.DataFrame(character_info, columns = ['name', 'number_of_comics', 'number_of_events', 'number_of_series',
                                                          'number_of_stories', 'character_id'])

In [17]:
marvels_database.head()

,name,number_of_comics,number_of_events,number_of_series,number_of_stories,character_id
0,A-Bomb (HAS),4,0,2,7,1017100
1,A.I.M.,52,0,34,54,1009144
2,Aaron Stack,14,0,3,27,1010699
3,Abomination (Emil Blonsky),54,1,27,64,1009146
4,Abomination (Ultimate),2,0,2,3,1016823

In [18]:
marvels_database.shape

(481, 6)

In [24]:
marvels_database.tail()

,name,number_of_comics,number_of_events,number_of_series,number_of_stories,character_id
476,Zeus,36,0,13,43,1011515
477,Zodiak,1,0,1,1,1011127
478,Zombie (Simon Garth),1,0,1,1,1009741
479,Zuras,3,0,3,3,1011183
480,Zzzax,5,0,4,6,1009742